{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Administrator\Downloads\King Stata final test.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Jan 2025, 01:14:33

{com}. do "C:\Users\ADMINI~1\AppData\Local\Temp\STD3b50_000000.tmp"
{txt}
{com}. *Importing dataset into stata // set your own directory
. import delimited "C:\Users\Administrator\Downloads\sample_data_set_RA_hiring.csv"
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(34 vars, 38,395 obs)

{com}. 
. * Create log of total monthly household expenditure
. gen ln_total_expenditure = log(total_expenditure)  
{txt}
{com}. 
. * Create log of residual income as a control variable
. gen ln_resid_income = log(resid_income)  
{txt}(2,094 missing values generated)

{com}. 
. * Generate a dummy variable indicating households in Vastrapur (New Kingdom)
. gen NK = (kingdom == "New Kingdom")  
{txt}
{com}. 
. * Create a time variable combining year and month
. gen time = ym(year, month)  
{txt}
{com}. format time %tm  
{txt}
{com}. 
. * Generate a dummy variable for the treatment period (for May 2016 onwards, when King's Gift policy was implemented)
. gen KG = (time >= ym(2016,5))  
{txt}
{com}. 
. * Create the interaction term for Difference-in-Differences (DID) estimation, to see the post policy effect
. gen NK_KG = NK * KG  
{txt}
{com}. 
. * Set panel data structure: household ID (hh_id) as the panel identifier and time as the time variable
. xtset hh_id time  
{res}
{col 1}{txt:Panel variable: }{res:hh_id}{txt: (unbalanced)}
{p 1 16 2}{txt:Time variable: }{res:time}{txt:, }{res:{bind:2015m11}}{txt: to }{res:{bind:2017m4}}{txt:, but with gaps}{p_end}
{txt}{col 10}Delta: {res}1 month
{txt}
{com}. 
. * Run DID regression for all farmers in Vastrapur
. * This assesses the average effects of the cash transfer policy across all farmers and we add time fixed effects and cluster errors by province: this gives the average treatment effect as 0.105, which means that cash transfer policy increases total expenditure of all farmers in Vastrapur by 10.5%, when controlling for inflation and residual income and including time fixed effects and clustering errors by province.
. xtreg ln_total_expenditure NK KG NK_KG ln_resid_income inflation_r i.time, fe vce(cluster province)  
{txt}note: NK omitted because of collinearity
note: 685.time omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}    36301
{txt}Group variable: {res}hh_id                           {txt}Number of groups   = {res}     3144

{txt}R-sq:  Within  = {res}0.1717                         {txt}Obs per group: min = {res}        1
{txt}       Between = {res}0.0193                                        {txt}avg = {res}     11.5
{txt}       Overall = {res}0.0868                                        {txt}max = {res}       18

{col 49}{help j_robustsingular##|_new:F(18,18)}{col 68}{txt}={col 70}{res}        .
{txt}corr(u_i, Xb)  = {res}-0.0519                        {txt}Prob > F           =    {res}     .

{txt}{ralign 79:(Std. err. adjusted for {res:19} clusters in {res:province})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}ln_total_ex~e{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}NK {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 11}KG {c |}{col 15}{res}{space 2} .2438095{col 27}{space 2}  .048924{col 38}{space 1}    4.98{col 47}{space 3}0.000{col 55}{space 4} .1410239{col 68}{space 3} .3465951
{txt}{space 8}NK_KG {c |}{col 15}{res}{space 2} .1070341{col 27}{space 2} .0494704{col 38}{space 1}    2.16{col 47}{space 3}0.044{col 55}{space 4} .0031008{col 68}{space 3} .2109675
{txt}ln_resid_in~e {c |}{col 15}{res}{space 2} .0069385{col 27}{space 2} .0044808{col 38}{space 1}    1.55{col 47}{space 3}0.139{col 55}{space 4}-.0024753{col 68}{space 3} .0163523
{txt}{space 2}inflation_r {c |}{col 15}{res}{space 2} .0013157{col 27}{space 2} .0038275{col 38}{space 1}    0.34{col 47}{space 3}0.735{col 55}{space 4}-.0067256{col 68}{space 3}  .009357
{txt}{space 13} {c |}
{space 9}time {c |}
{space 9}671  {c |}{col 15}{res}{space 2} .0330701{col 27}{space 2} .0174281{col 38}{space 1}    1.90{col 47}{space 3}0.074{col 55}{space 4} -.003545{col 68}{space 3} .0696853
{txt}{space 9}672  {c |}{col 15}{res}{space 2} .1463166{col 27}{space 2}  .025714{col 38}{space 1}    5.69{col 47}{space 3}0.000{col 55}{space 4} .0922936{col 68}{space 3} .2003397
{txt}{space 9}673  {c |}{col 15}{res}{space 2} .0224014{col 27}{space 2} .0421384{col 38}{space 1}    0.53{col 47}{space 3}0.601{col 55}{space 4}-.0661281{col 68}{space 3}  .110931
{txt}{space 9}674  {c |}{col 15}{res}{space 2} .0836197{col 27}{space 2} .0420218{col 38}{space 1}    1.99{col 47}{space 3}0.062{col 55}{space 4}-.0046648{col 68}{space 3} .1719042
{txt}{space 9}675  {c |}{col 15}{res}{space 2} .1017122{col 27}{space 2} .0476347{col 38}{space 1}    2.14{col 47}{space 3}0.047{col 55}{space 4} .0016355{col 68}{space 3}  .201789
{txt}{space 9}676  {c |}{col 15}{res}{space 2}-.1566842{col 27}{space 2}  .056527{col 38}{space 1}   -2.77{col 47}{space 3}0.013{col 55}{space 4}-.2754431{col 68}{space 3}-.0379253
{txt}{space 9}677  {c |}{col 15}{res}{space 2}-.0829867{col 27}{space 2} .0517629{col 38}{space 1}   -1.60{col 47}{space 3}0.126{col 55}{space 4}-.1917366{col 68}{space 3} .0257632
{txt}{space 9}678  {c |}{col 15}{res}{space 2}-.0878478{col 27}{space 2} .0515099{col 38}{space 1}   -1.71{col 47}{space 3}0.105{col 55}{space 4}-.1960661{col 68}{space 3} .0203705
{txt}{space 9}679  {c |}{col 15}{res}{space 2}-.0750903{col 27}{space 2} .0546614{col 38}{space 1}   -1.37{col 47}{space 3}0.186{col 55}{space 4}-.1899297{col 68}{space 3} .0397491
{txt}{space 9}680  {c |}{col 15}{res}{space 2}-.1021513{col 27}{space 2} .0513891{col 38}{space 1}   -1.99{col 47}{space 3}0.062{col 55}{space 4}-.2101157{col 68}{space 3} .0058131
{txt}{space 9}681  {c |}{col 15}{res}{space 2}-.0237918{col 27}{space 2} .0459791{col 38}{space 1}   -0.52{col 47}{space 3}0.611{col 55}{space 4}-.1203903{col 68}{space 3} .0728067
{txt}{space 9}682  {c |}{col 15}{res}{space 2}-.0234863{col 27}{space 2} .0295774{col 38}{space 1}   -0.79{col 47}{space 3}0.438{col 55}{space 4} -.085626{col 68}{space 3} .0386534
{txt}{space 9}683  {c |}{col 15}{res}{space 2}-.0342126{col 27}{space 2} .0359483{col 38}{space 1}   -0.95{col 47}{space 3}0.354{col 55}{space 4}-.1097371{col 68}{space 3} .0413119
{txt}{space 9}684  {c |}{col 15}{res}{space 2}  .005078{col 27}{space 2} .0278658{col 38}{space 1}    0.18{col 47}{space 3}0.857{col 55}{space 4}-.0534659{col 68}{space 3} .0636218
{txt}{space 9}685  {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 9}686  {c |}{col 15}{res}{space 2}-.0030008{col 27}{space 2}  .027341{col 38}{space 1}   -0.11{col 47}{space 3}0.914{col 55}{space 4}-.0604422{col 68}{space 3} .0544406
{txt}{space 9}687  {c |}{col 15}{res}{space 2} .0324688{col 27}{space 2} .0216969{col 38}{space 1}    1.50{col 47}{space 3}0.152{col 55}{space 4}-.0131148{col 68}{space 3} .0780523
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} 8.738961{col 27}{space 2} .5725316{col 38}{space 1}   15.26{col 47}{space 3}0.000{col 55}{space 4} 7.536117{col 68}{space 3} 9.941806
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |} {res} .26334282
      {txt}sigma_e {c |} {res} .22201403
          {txt}rho {c |} {res} .58453837{txt}   (fraction of variance due to u_i)
{hline 14}{c BT}{hline 64}

{com}. 
. *The policy had a statistically significant (as the p value 0.04 is less than 5% level of significance) positive impact on household consumption in Vastrapur.
. 
. 
. * Generate a dummy variable indicating if the household is a small farmer
. gen is_small_farmer = (hh_occupation == "Small Farmers")  
{txt}
{com}. 
. * Run DID regression for small farmers
. * This evaluates the effect of the cash transfer policy specifically for small farmers. This assesses the average effects of the cash transfer policy across small farmers and we add time fixed effects and cluster errors by province:This gives the average treatment effect as 0.115, which means that cash transfer policy increases total expenditure of small farmers in Vastrapur by 11.5%, when controlling for inflation and residual income and including time fixed effects and clustering errors by province.
. xtreg ln_total_expenditure NK KG NK_KG ln_resid_income inflation_r i.time if is_small_farmer == 1, fe vce(cluster province) 
{txt}note: NK omitted because of collinearity
note: 685.time omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}    21040
{txt}Group variable: {res}hh_id                           {txt}Number of groups   = {res}     2279

{txt}R-sq:  Within  = {res}0.2132                         {txt}Obs per group: min = {res}        1
{txt}       Between = {res}0.0266                                        {txt}avg = {res}      9.2
{txt}       Overall = {res}0.1112                                        {txt}max = {res}       18

{col 49}{help j_robustsingular##|_new:F(18,18)}{col 68}{txt}={col 70}{res}        .
{txt}corr(u_i, Xb)  = {res}-0.1163                        {txt}Prob > F           =    {res}     .

{txt}{ralign 79:(Std. err. adjusted for {res:19} clusters in {res:province})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}ln_total_ex~e{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}NK {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 11}KG {c |}{col 15}{res}{space 2} .1974417{col 27}{space 2} .0481232{col 38}{space 1}    4.10{col 47}{space 3}0.001{col 55}{space 4} .0963387{col 68}{space 3} .2985448
{txt}{space 8}NK_KG {c |}{col 15}{res}{space 2}  .115273{col 27}{space 2} .0382393{col 38}{space 1}    3.01{col 47}{space 3}0.007{col 55}{space 4} .0349353{col 68}{space 3} .1956108
{txt}ln_resid_in~e {c |}{col 15}{res}{space 2} .0057872{col 27}{space 2} .0033929{col 38}{space 1}    1.71{col 47}{space 3}0.105{col 55}{space 4}-.0013409{col 68}{space 3} .0129154
{txt}{space 2}inflation_r {c |}{col 15}{res}{space 2}-.0017297{col 27}{space 2} .0032822{col 38}{space 1}   -0.53{col 47}{space 3}0.605{col 55}{space 4}-.0086254{col 68}{space 3} .0051661
{txt}{space 13} {c |}
{space 9}time {c |}
{space 9}671  {c |}{col 15}{res}{space 2}-.0013369{col 27}{space 2} .0213469{col 38}{space 1}   -0.06{col 47}{space 3}0.951{col 55}{space 4} -.046185{col 68}{space 3} .0435112
{txt}{space 9}672  {c |}{col 15}{res}{space 2} .0999928{col 27}{space 2} .0361311{col 38}{space 1}    2.77{col 47}{space 3}0.013{col 55}{space 4} .0240842{col 68}{space 3} .1759014
{txt}{space 9}673  {c |}{col 15}{res}{space 2}-.0272881{col 27}{space 2} .0371466{col 38}{space 1}   -0.73{col 47}{space 3}0.472{col 55}{space 4}-.1053302{col 68}{space 3}  .050754
{txt}{space 9}674  {c |}{col 15}{res}{space 2} .0315111{col 27}{space 2} .0460967{col 38}{space 1}    0.68{col 47}{space 3}0.503{col 55}{space 4}-.0653344{col 68}{space 3} .1283566
{txt}{space 9}675  {c |}{col 15}{res}{space 2} .0486212{col 27}{space 2} .0542314{col 38}{space 1}    0.90{col 47}{space 3}0.382{col 55}{space 4}-.0653148{col 68}{space 3} .1625572
{txt}{space 9}676  {c |}{col 15}{res}{space 2}-.1639931{col 27}{space 2} .0363729{col 38}{space 1}   -4.51{col 47}{space 3}0.000{col 55}{space 4}-.2404098{col 68}{space 3}-.0875764
{txt}{space 9}677  {c |}{col 15}{res}{space 2}-.1134071{col 27}{space 2} .0418359{col 38}{space 1}   -2.71{col 47}{space 3}0.014{col 55}{space 4} -.201301{col 68}{space 3}-.0255132
{txt}{space 9}678  {c |}{col 15}{res}{space 2}-.0969993{col 27}{space 2} .0429264{col 38}{space 1}   -2.26{col 47}{space 3}0.036{col 55}{space 4}-.1871844{col 68}{space 3}-.0068143
{txt}{space 9}679  {c |}{col 15}{res}{space 2}-.0720643{col 27}{space 2} .0509781{col 38}{space 1}   -1.41{col 47}{space 3}0.175{col 55}{space 4}-.1791654{col 68}{space 3} .0350368
{txt}{space 9}680  {c |}{col 15}{res}{space 2}-.0849589{col 27}{space 2} .0494877{col 38}{space 1}   -1.72{col 47}{space 3}0.103{col 55}{space 4}-.1889288{col 68}{space 3} .0190109
{txt}{space 9}681  {c |}{col 15}{res}{space 2}-.0124641{col 27}{space 2} .0686834{col 38}{space 1}   -0.18{col 47}{space 3}0.858{col 55}{space 4}-.1567627{col 68}{space 3} .1318344
{txt}{space 9}682  {c |}{col 15}{res}{space 2}-.0253532{col 27}{space 2} .0319363{col 38}{space 1}   -0.79{col 47}{space 3}0.438{col 55}{space 4}-.0924489{col 68}{space 3} .0417425
{txt}{space 9}683  {c |}{col 15}{res}{space 2}-.0392706{col 27}{space 2} .0459569{col 38}{space 1}   -0.85{col 47}{space 3}0.404{col 55}{space 4}-.1358226{col 68}{space 3} .0572813
{txt}{space 9}684  {c |}{col 15}{res}{space 2} .0129785{col 27}{space 2} .0302475{col 38}{space 1}    0.43{col 47}{space 3}0.673{col 55}{space 4}-.0505691{col 68}{space 3} .0765262
{txt}{space 9}685  {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 9}686  {c |}{col 15}{res}{space 2}-.0094633{col 27}{space 2}  .031627{col 38}{space 1}   -0.30{col 47}{space 3}0.768{col 55}{space 4}-.0759091{col 68}{space 3} .0569825
{txt}{space 9}687  {c |}{col 15}{res}{space 2}   .03273{col 27}{space 2} .0202495{col 38}{space 1}    1.62{col 47}{space 3}0.123{col 55}{space 4}-.0098126{col 68}{space 3} .0752726
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} 9.238913{col 27}{space 2} .4770807{col 38}{space 1}   19.37{col 47}{space 3}0.000{col 55}{space 4} 8.236604{col 68}{space 3} 10.24122
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |} {res} .23862352
      {txt}sigma_e {c |} {res} .19892612
          {txt}rho {c |} {res} .58998591{txt}   (fraction of variance due to u_i)
{hline 14}{c BT}{hline 64}

{com}. 
. *Small farmers experience the largest benefit amongst all, as their total expenditure increased the most due to King's gift policy. The impact is statistically significant at 1 % level of significance, for p value of interaction term is 0.007, less than 0.01.
. 
. * Generate a dummy variable indicating if the household is a large farmer
. gen is_large_farmer = (hh_occupation == "Large Farmers")  
{txt}
{com}. 
. * Run DID regression for large farmers
. * This evaluates the effect of the cash transfer policy specifically for large farmers. This assesses the average effects of the cash transfer policy across large farmers and we add time fixed effects and cluster errors by province: this gives the average treatment effect as 0.105, which means that cash transfer policy increases total expenditure of large farmers in Vastrapur by 7.6%, when controlling for inflation and residual income and including time fixed effects and clustering errors by province.
. xtreg ln_total_expenditure NK KG NK_KG ln_resid_income inflation_r i.time if is_large_farmer == 1, fe vce(cluster province)  
{txt}note: NK omitted because of collinearity
note: 684.time omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}     4061
{txt}Group variable: {res}hh_id                           {txt}Number of groups   = {res}      629

{txt}R-sq:  Within  = {res}0.0889                         {txt}Obs per group: min = {res}        1
{txt}       Between = {res}0.1137                                        {txt}avg = {res}      6.5
{txt}       Overall = {res}0.0825                                        {txt}max = {res}       18

{col 49}{help j_robustsingular##|_new:F(17,17)}{col 68}{txt}={col 70}{res}        .
{txt}corr(u_i, Xb)  = {res}0.0290                         {txt}Prob > F           =    {res}     .

{txt}{ralign 79:(Std. err. adjusted for {res:18} clusters in {res:province})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}ln_total_ex~e{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}NK {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 11}KG {c |}{col 15}{res}{space 2} .1046444{col 27}{space 2} .0686764{col 38}{space 1}    1.52{col 47}{space 3}0.146{col 55}{space 4}  -.04025{col 68}{space 3} .2495389
{txt}{space 8}NK_KG {c |}{col 15}{res}{space 2} .0764371{col 27}{space 2} .0724559{col 38}{space 1}    1.05{col 47}{space 3}0.306{col 55}{space 4}-.0764316{col 68}{space 3} .2293058
{txt}ln_resid_in~e {c |}{col 15}{res}{space 2}-.0018448{col 27}{space 2} .0040503{col 38}{space 1}   -0.46{col 47}{space 3}0.655{col 55}{space 4}-.0103902{col 68}{space 3} .0067007
{txt}{space 2}inflation_r {c |}{col 15}{res}{space 2}-.0062591{col 27}{space 2} .0060213{col 38}{space 1}   -1.04{col 47}{space 3}0.313{col 55}{space 4}-.0189631{col 68}{space 3} .0064448
{txt}{space 13} {c |}
{space 9}time {c |}
{space 9}671  {c |}{col 15}{res}{space 2} .0016659{col 27}{space 2} .0240298{col 38}{space 1}    0.07{col 47}{space 3}0.946{col 55}{space 4}-.0490326{col 68}{space 3} .0523644
{txt}{space 9}672  {c |}{col 15}{res}{space 2} .1606194{col 27}{space 2} .0482067{col 38}{space 1}    3.33{col 47}{space 3}0.004{col 55}{space 4} .0589122{col 68}{space 3} .2623266
{txt}{space 9}673  {c |}{col 15}{res}{space 2} .0127495{col 27}{space 2} .0609814{col 38}{space 1}    0.21{col 47}{space 3}0.837{col 55}{space 4}  -.11591{col 68}{space 3}  .141409
{txt}{space 9}674  {c |}{col 15}{res}{space 2} .0395434{col 27}{space 2}  .064423{col 38}{space 1}    0.61{col 47}{space 3}0.547{col 55}{space 4}-.0963771{col 68}{space 3}  .175464
{txt}{space 9}675  {c |}{col 15}{res}{space 2} .0273758{col 27}{space 2} .0603066{col 38}{space 1}    0.45{col 47}{space 3}0.656{col 55}{space 4}-.0998601{col 68}{space 3} .1546117
{txt}{space 9}676  {c |}{col 15}{res}{space 2}-.0760795{col 27}{space 2} .0528925{col 38}{space 1}   -1.44{col 47}{space 3}0.168{col 55}{space 4}-.1876729{col 68}{space 3}  .035514
{txt}{space 9}677  {c |}{col 15}{res}{space 2} .0290436{col 27}{space 2} .0587401{col 38}{space 1}    0.49{col 47}{space 3}0.627{col 55}{space 4}-.0948873{col 68}{space 3} .1529744
{txt}{space 9}678  {c |}{col 15}{res}{space 2} .0208036{col 27}{space 2} .0541842{col 38}{space 1}    0.38{col 47}{space 3}0.706{col 55}{space 4} -.093515{col 68}{space 3} .1351222
{txt}{space 9}679  {c |}{col 15}{res}{space 2} .0360107{col 27}{space 2}  .044096{col 38}{space 1}    0.82{col 47}{space 3}0.425{col 55}{space 4}-.0570238{col 68}{space 3} .1290451
{txt}{space 9}680  {c |}{col 15}{res}{space 2} .0239178{col 27}{space 2} .0412674{col 38}{space 1}    0.58{col 47}{space 3}0.570{col 55}{space 4}-.0631487{col 68}{space 3} .1109843
{txt}{space 9}681  {c |}{col 15}{res}{space 2} .0829374{col 27}{space 2} .0365663{col 38}{space 1}    2.27{col 47}{space 3}0.037{col 55}{space 4} .0057894{col 68}{space 3} .1600855
{txt}{space 9}682  {c |}{col 15}{res}{space 2} .0435947{col 27}{space 2} .0279445{col 38}{space 1}    1.56{col 47}{space 3}0.137{col 55}{space 4}-.0153629{col 68}{space 3} .1025524
{txt}{space 9}683  {c |}{col 15}{res}{space 2}-.0096229{col 27}{space 2} .0263691{col 38}{space 1}   -0.36{col 47}{space 3}0.720{col 55}{space 4}-.0652568{col 68}{space 3}  .046011
{txt}{space 9}684  {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 9}685  {c |}{col 15}{res}{space 2}-.0056101{col 27}{space 2} .0335558{col 38}{space 1}   -0.17{col 47}{space 3}0.869{col 55}{space 4}-.0764067{col 68}{space 3} .0651864
{txt}{space 9}686  {c |}{col 15}{res}{space 2} .0043656{col 27}{space 2} .0434317{col 38}{space 1}    0.10{col 47}{space 3}0.921{col 55}{space 4}-.0872674{col 68}{space 3} .0959986
{txt}{space 9}687  {c |}{col 15}{res}{space 2} .0270572{col 27}{space 2} .0504696{col 38}{space 1}    0.54{col 47}{space 3}0.599{col 55}{space 4}-.0794244{col 68}{space 3} .1335388
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} 10.18695{col 27}{space 2} .8832242{col 38}{space 1}   11.53{col 47}{space 3}0.000{col 55}{space 4} 8.323513{col 68}{space 3} 12.05039
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |} {res} .25104059
      {txt}sigma_e {c |} {res} .20527971
          {txt}rho {c |} {res}  .5992839{txt}   (fraction of variance due to u_i)
{hline 14}{c BT}{hline 64}

{com}. 
. *The policy positively impacted the expenditure of large farmers too, but was lower compared to small farmers. But this effect is not statistically significant as though consumption is meant to increase by 7.6% , the p value is 0.3, greater than 5% level of significance and hence not that significant. We can say that this is significant at 10 % level of significance and probably, the increase cannot be solely attributed to the cash transfer policy and the regression needs more controls to be added. 
. 
. * Generate a dummy variable indicating if the household is an agricultural laborer
. gen is_agri_labourer = (hh_occupation == "Agricultural Labourers")  
{txt}
{com}. 
. * Run DID regression for agricultural laborers
. * This evaluates the effect of the cash transfer policy specifically for agricultural laborers. This assesses the average effects of the cash transfer policy across agricultural laborers and we add time fixed effects and cluster errors by province:this gives the average treatment effect as 0.105, which means that cash transfer policy decreases total expenditure of agricultural labourers in Vastrapur by 0.3%, when controlling for inflation and residual income and including time fixed effects and clustering errors by province.
. xtreg ln_total_expenditure NK KG NK_KG ln_resid_income inflation_r i.time if is_agri_labourer == 1, fe vce(cluster province)  
{txt}note: NK omitted because of collinearity
note: 679.time omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}    11200
{txt}Group variable: {res}hh_id                           {txt}Number of groups   = {res}     1520

{txt}R-sq:  Within  = {res}0.1456                         {txt}Obs per group: min = {res}        1
{txt}       Between = {res}0.2454                                        {txt}avg = {res}      7.4
{txt}       Overall = {res}0.2373                                        {txt}max = {res}       18

{col 49}{help j_robustsingular##|_new:F(18,18)}{col 68}{txt}={col 70}{res}        .
{txt}corr(u_i, Xb)  = {res}0.2660                         {txt}Prob > F           =    {res}     .

{txt}{ralign 79:(Std. err. adjusted for {res:19} clusters in {res:province})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}ln_total_ex~e{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}NK {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 11}KG {c |}{col 15}{res}{space 2} .2354737{col 27}{space 2} .0474796{col 38}{space 1}    4.96{col 47}{space 3}0.000{col 55}{space 4} .1357229{col 68}{space 3} .3352246
{txt}{space 8}NK_KG {c |}{col 15}{res}{space 2}-.0037035{col 27}{space 2} .0512559{col 38}{space 1}   -0.07{col 47}{space 3}0.943{col 55}{space 4}-.1113881{col 68}{space 3} .1039811
{txt}ln_resid_in~e {c |}{col 15}{res}{space 2} .1260045{col 27}{space 2} .0219198{col 38}{space 1}    5.75{col 47}{space 3}0.000{col 55}{space 4} .0799527{col 68}{space 3} .1720562
{txt}{space 2}inflation_r {c |}{col 15}{res}{space 2} .0144777{col 27}{space 2} .0065354{col 38}{space 1}    2.22{col 47}{space 3}0.040{col 55}{space 4} .0007473{col 68}{space 3}  .028208
{txt}{space 13} {c |}
{space 9}time {c |}
{space 9}671  {c |}{col 15}{res}{space 2} .0713482{col 27}{space 2} .0193469{col 38}{space 1}    3.69{col 47}{space 3}0.002{col 55}{space 4} .0307018{col 68}{space 3} .1119946
{txt}{space 9}672  {c |}{col 15}{res}{space 2} .1843591{col 27}{space 2} .0266362{col 38}{space 1}    6.92{col 47}{space 3}0.000{col 55}{space 4} .1283985{col 68}{space 3} .2403197
{txt}{space 9}673  {c |}{col 15}{res}{space 2} .0832402{col 27}{space 2}  .057775{col 38}{space 1}    1.44{col 47}{space 3}0.167{col 55}{space 4}-.0381406{col 68}{space 3} .2046211
{txt}{space 9}674  {c |}{col 15}{res}{space 2} .1565513{col 27}{space 2} .0555269{col 38}{space 1}    2.82{col 47}{space 3}0.011{col 55}{space 4} .0398937{col 68}{space 3} .2732089
{txt}{space 9}675  {c |}{col 15}{res}{space 2} .1807318{col 27}{space 2} .0657353{col 38}{space 1}    2.75{col 47}{space 3}0.013{col 55}{space 4} .0426272{col 68}{space 3} .3188365
{txt}{space 9}676  {c |}{col 15}{res}{space 2}-.0540779{col 27}{space 2}  .062409{col 38}{space 1}   -0.87{col 47}{space 3}0.398{col 55}{space 4}-.1851945{col 68}{space 3} .0770386
{txt}{space 9}677  {c |}{col 15}{res}{space 2} .0335213{col 27}{space 2} .0328233{col 38}{space 1}    1.02{col 47}{space 3}0.321{col 55}{space 4}-.0354379{col 68}{space 3} .1024806
{txt}{space 9}678  {c |}{col 15}{res}{space 2} .0064513{col 27}{space 2} .0264114{col 38}{space 1}    0.24{col 47}{space 3}0.810{col 55}{space 4}-.0490369{col 68}{space 3} .0619395
{txt}{space 9}679  {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 9}680  {c |}{col 15}{res}{space 2}-.0490551{col 27}{space 2}  .033049{col 38}{space 1}   -1.48{col 47}{space 3}0.155{col 55}{space 4}-.1184885{col 68}{space 3} .0203783
{txt}{space 9}681  {c |}{col 15}{res}{space 2} .0501476{col 27}{space 2} .0464269{col 38}{space 1}    1.08{col 47}{space 3}0.294{col 55}{space 4}-.0473918{col 68}{space 3} .1476869
{txt}{space 9}682  {c |}{col 15}{res}{space 2} .0459155{col 27}{space 2} .0726798{col 38}{space 1}    0.63{col 47}{space 3}0.535{col 55}{space 4}-.1067791{col 68}{space 3} .1986101
{txt}{space 9}683  {c |}{col 15}{res}{space 2} .0608081{col 27}{space 2}  .064534{col 38}{space 1}    0.94{col 47}{space 3}0.359{col 55}{space 4}-.0747728{col 68}{space 3}  .196389
{txt}{space 9}684  {c |}{col 15}{res}{space 2} .0646876{col 27}{space 2} .0528521{col 38}{space 1}    1.22{col 47}{space 3}0.237{col 55}{space 4}-.0463505{col 68}{space 3} .1757256
{txt}{space 9}685  {c |}{col 15}{res}{space 2} .0822938{col 27}{space 2} .0574844{col 38}{space 1}    1.43{col 47}{space 3}0.169{col 55}{space 4}-.0384766{col 68}{space 3} .2030641
{txt}{space 9}686  {c |}{col 15}{res}{space 2} .0957572{col 27}{space 2}  .062744{col 38}{space 1}    1.53{col 47}{space 3}0.144{col 55}{space 4}-.0360632{col 68}{space 3} .2275775
{txt}{space 9}687  {c |}{col 15}{res}{space 2} .1128204{col 27}{space 2} .0526157{col 38}{space 1}    2.14{col 47}{space 3}0.046{col 55}{space 4} .0022789{col 68}{space 3}  .223362
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} 5.614702{col 27}{space 2} .9354033{col 38}{space 1}    6.00{col 47}{space 3}0.000{col 55}{space 4} 3.649493{col 68}{space 3} 7.579912
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |} {res} .27389689
      {txt}sigma_e {c |} {res} .21532849
          {txt}rho {c |} {res} .61802507{txt}   (fraction of variance due to u_i)
{hline 14}{c BT}{hline 64}

{com}. 
. *Thus, the cash transfer policy though positively impacts small and large farmers, it does not benefit the agricultural labourers much and rather slightly decreases their total household expenditure by 0.3% which is but insignificant as p value is  0.9, greater than any significance level. This could also mean there maybe a potential inequity in policy design or implementation. 
. 
. * Clear stored estimation results
. eststo clear  
{txt}
{com}. 
. * Store and label the first regression results (all farmers) for LaTeX output
. eststo est1: xtreg ln_total_expenditure NK KG NK_KG ln_resid_income inflation_r i.time, fe vce(cluster province)  
{txt}note: NK omitted because of collinearity
note: 685.time omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}    36301
{txt}Group variable: {res}hh_id                           {txt}Number of groups   = {res}     3144

{txt}R-sq:  Within  = {res}0.1717                         {txt}Obs per group: min = {res}        1
{txt}       Between = {res}0.0193                                        {txt}avg = {res}     11.5
{txt}       Overall = {res}0.0868                                        {txt}max = {res}       18

{col 49}{help j_robustsingular##|_new:F(18,18)}{col 68}{txt}={col 70}{res}        .
{txt}corr(u_i, Xb)  = {res}-0.0519                        {txt}Prob > F           =    {res}     .

{txt}{ralign 79:(Std. err. adjusted for {res:19} clusters in {res:province})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}ln_total_ex~e{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}NK {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 11}KG {c |}{col 15}{res}{space 2} .2438095{col 27}{space 2}  .048924{col 38}{space 1}    4.98{col 47}{space 3}0.000{col 55}{space 4} .1410239{col 68}{space 3} .3465951
{txt}{space 8}NK_KG {c |}{col 15}{res}{space 2} .1070341{col 27}{space 2} .0494704{col 38}{space 1}    2.16{col 47}{space 3}0.044{col 55}{space 4} .0031008{col 68}{space 3} .2109675
{txt}ln_resid_in~e {c |}{col 15}{res}{space 2} .0069385{col 27}{space 2} .0044808{col 38}{space 1}    1.55{col 47}{space 3}0.139{col 55}{space 4}-.0024753{col 68}{space 3} .0163523
{txt}{space 2}inflation_r {c |}{col 15}{res}{space 2} .0013157{col 27}{space 2} .0038275{col 38}{space 1}    0.34{col 47}{space 3}0.735{col 55}{space 4}-.0067256{col 68}{space 3}  .009357
{txt}{space 13} {c |}
{space 9}time {c |}
{space 9}671  {c |}{col 15}{res}{space 2} .0330701{col 27}{space 2} .0174281{col 38}{space 1}    1.90{col 47}{space 3}0.074{col 55}{space 4} -.003545{col 68}{space 3} .0696853
{txt}{space 9}672  {c |}{col 15}{res}{space 2} .1463166{col 27}{space 2}  .025714{col 38}{space 1}    5.69{col 47}{space 3}0.000{col 55}{space 4} .0922936{col 68}{space 3} .2003397
{txt}{space 9}673  {c |}{col 15}{res}{space 2} .0224014{col 27}{space 2} .0421384{col 38}{space 1}    0.53{col 47}{space 3}0.601{col 55}{space 4}-.0661281{col 68}{space 3}  .110931
{txt}{space 9}674  {c |}{col 15}{res}{space 2} .0836197{col 27}{space 2} .0420218{col 38}{space 1}    1.99{col 47}{space 3}0.062{col 55}{space 4}-.0046648{col 68}{space 3} .1719042
{txt}{space 9}675  {c |}{col 15}{res}{space 2} .1017122{col 27}{space 2} .0476347{col 38}{space 1}    2.14{col 47}{space 3}0.047{col 55}{space 4} .0016355{col 68}{space 3}  .201789
{txt}{space 9}676  {c |}{col 15}{res}{space 2}-.1566842{col 27}{space 2}  .056527{col 38}{space 1}   -2.77{col 47}{space 3}0.013{col 55}{space 4}-.2754431{col 68}{space 3}-.0379253
{txt}{space 9}677  {c |}{col 15}{res}{space 2}-.0829867{col 27}{space 2} .0517629{col 38}{space 1}   -1.60{col 47}{space 3}0.126{col 55}{space 4}-.1917366{col 68}{space 3} .0257632
{txt}{space 9}678  {c |}{col 15}{res}{space 2}-.0878478{col 27}{space 2} .0515099{col 38}{space 1}   -1.71{col 47}{space 3}0.105{col 55}{space 4}-.1960661{col 68}{space 3} .0203705
{txt}{space 9}679  {c |}{col 15}{res}{space 2}-.0750903{col 27}{space 2} .0546614{col 38}{space 1}   -1.37{col 47}{space 3}0.186{col 55}{space 4}-.1899297{col 68}{space 3} .0397491
{txt}{space 9}680  {c |}{col 15}{res}{space 2}-.1021513{col 27}{space 2} .0513891{col 38}{space 1}   -1.99{col 47}{space 3}0.062{col 55}{space 4}-.2101157{col 68}{space 3} .0058131
{txt}{space 9}681  {c |}{col 15}{res}{space 2}-.0237918{col 27}{space 2} .0459791{col 38}{space 1}   -0.52{col 47}{space 3}0.611{col 55}{space 4}-.1203903{col 68}{space 3} .0728067
{txt}{space 9}682  {c |}{col 15}{res}{space 2}-.0234863{col 27}{space 2} .0295774{col 38}{space 1}   -0.79{col 47}{space 3}0.438{col 55}{space 4} -.085626{col 68}{space 3} .0386534
{txt}{space 9}683  {c |}{col 15}{res}{space 2}-.0342126{col 27}{space 2} .0359483{col 38}{space 1}   -0.95{col 47}{space 3}0.354{col 55}{space 4}-.1097371{col 68}{space 3} .0413119
{txt}{space 9}684  {c |}{col 15}{res}{space 2}  .005078{col 27}{space 2} .0278658{col 38}{space 1}    0.18{col 47}{space 3}0.857{col 55}{space 4}-.0534659{col 68}{space 3} .0636218
{txt}{space 9}685  {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 9}686  {c |}{col 15}{res}{space 2}-.0030008{col 27}{space 2}  .027341{col 38}{space 1}   -0.11{col 47}{space 3}0.914{col 55}{space 4}-.0604422{col 68}{space 3} .0544406
{txt}{space 9}687  {c |}{col 15}{res}{space 2} .0324688{col 27}{space 2} .0216969{col 38}{space 1}    1.50{col 47}{space 3}0.152{col 55}{space 4}-.0131148{col 68}{space 3} .0780523
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} 8.738961{col 27}{space 2} .5725316{col 38}{space 1}   15.26{col 47}{space 3}0.000{col 55}{space 4} 7.536117{col 68}{space 3} 9.941806
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |} {res} .26334282
      {txt}sigma_e {c |} {res} .22201403
          {txt}rho {c |} {res} .58453837{txt}   (fraction of variance due to u_i)
{hline 14}{c BT}{hline 64}

{com}. 
. * Add fixed effects labels to the table
. estadd local Time_FE "yes"  

{txt}added macro:
            e(Time_FE) : "{res:yes}"

{com}. estadd local Household_FE "yes"  

{txt}added macro:
       e(Household_FE) : "{res:yes}"

{com}. 
. * Export regression results to LaTeX for all farmers
. esttab est1 using didreg1.tex, ///
>    cells(b(fmt(3) star) se(fmt(3) par)) ///
>    label nodepvars nomtitle nonumber ///
>    noobs collabels("Dependent Variable: Log total expenditure" "") ///
>    varlabels(NK "New Kingdom" KG "King's Gift"  NK_KG "New Kingdom*King's Gift" inflation_r "Rural Inflation" ln_resid_income "Residual Income") ///
>    stats(r2 N) ///
>    starlevels(* 0.10 * 0.05 ** 0.01) ///
>    addnote("***p$<$0.01, ** p$<$0.05, * p$<$0.1") ///
>    title("Regression Results showing effect of cash transfer policy to Vastrapur farmers") ///
>    replace  
{res}{txt}(output written to {browse  `"didreg1.tex"'})

{com}. 
. * Store and label the second regression results (small farmers) for LaTeX output
. eststo est2: xtreg ln_total_expenditure NK KG NK_KG ln_resid_income inflation_r i.time if is_small_farmer == 1, fe vce(cluster province)  
{txt}note: NK omitted because of collinearity
note: 685.time omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}    21040
{txt}Group variable: {res}hh_id                           {txt}Number of groups   = {res}     2279

{txt}R-sq:  Within  = {res}0.2132                         {txt}Obs per group: min = {res}        1
{txt}       Between = {res}0.0266                                        {txt}avg = {res}      9.2
{txt}       Overall = {res}0.1112                                        {txt}max = {res}       18

{col 49}{help j_robustsingular##|_new:F(18,18)}{col 68}{txt}={col 70}{res}        .
{txt}corr(u_i, Xb)  = {res}-0.1163                        {txt}Prob > F           =    {res}     .

{txt}{ralign 79:(Std. err. adjusted for {res:19} clusters in {res:province})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}ln_total_ex~e{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}NK {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 11}KG {c |}{col 15}{res}{space 2} .1974417{col 27}{space 2} .0481232{col 38}{space 1}    4.10{col 47}{space 3}0.001{col 55}{space 4} .0963387{col 68}{space 3} .2985448
{txt}{space 8}NK_KG {c |}{col 15}{res}{space 2}  .115273{col 27}{space 2} .0382393{col 38}{space 1}    3.01{col 47}{space 3}0.007{col 55}{space 4} .0349353{col 68}{space 3} .1956108
{txt}ln_resid_in~e {c |}{col 15}{res}{space 2} .0057872{col 27}{space 2} .0033929{col 38}{space 1}    1.71{col 47}{space 3}0.105{col 55}{space 4}-.0013409{col 68}{space 3} .0129154
{txt}{space 2}inflation_r {c |}{col 15}{res}{space 2}-.0017297{col 27}{space 2} .0032822{col 38}{space 1}   -0.53{col 47}{space 3}0.605{col 55}{space 4}-.0086254{col 68}{space 3} .0051661
{txt}{space 13} {c |}
{space 9}time {c |}
{space 9}671  {c |}{col 15}{res}{space 2}-.0013369{col 27}{space 2} .0213469{col 38}{space 1}   -0.06{col 47}{space 3}0.951{col 55}{space 4} -.046185{col 68}{space 3} .0435112
{txt}{space 9}672  {c |}{col 15}{res}{space 2} .0999928{col 27}{space 2} .0361311{col 38}{space 1}    2.77{col 47}{space 3}0.013{col 55}{space 4} .0240842{col 68}{space 3} .1759014
{txt}{space 9}673  {c |}{col 15}{res}{space 2}-.0272881{col 27}{space 2} .0371466{col 38}{space 1}   -0.73{col 47}{space 3}0.472{col 55}{space 4}-.1053302{col 68}{space 3}  .050754
{txt}{space 9}674  {c |}{col 15}{res}{space 2} .0315111{col 27}{space 2} .0460967{col 38}{space 1}    0.68{col 47}{space 3}0.503{col 55}{space 4}-.0653344{col 68}{space 3} .1283566
{txt}{space 9}675  {c |}{col 15}{res}{space 2} .0486212{col 27}{space 2} .0542314{col 38}{space 1}    0.90{col 47}{space 3}0.382{col 55}{space 4}-.0653148{col 68}{space 3} .1625572
{txt}{space 9}676  {c |}{col 15}{res}{space 2}-.1639931{col 27}{space 2} .0363729{col 38}{space 1}   -4.51{col 47}{space 3}0.000{col 55}{space 4}-.2404098{col 68}{space 3}-.0875764
{txt}{space 9}677  {c |}{col 15}{res}{space 2}-.1134071{col 27}{space 2} .0418359{col 38}{space 1}   -2.71{col 47}{space 3}0.014{col 55}{space 4} -.201301{col 68}{space 3}-.0255132
{txt}{space 9}678  {c |}{col 15}{res}{space 2}-.0969993{col 27}{space 2} .0429264{col 38}{space 1}   -2.26{col 47}{space 3}0.036{col 55}{space 4}-.1871844{col 68}{space 3}-.0068143
{txt}{space 9}679  {c |}{col 15}{res}{space 2}-.0720643{col 27}{space 2} .0509781{col 38}{space 1}   -1.41{col 47}{space 3}0.175{col 55}{space 4}-.1791654{col 68}{space 3} .0350368
{txt}{space 9}680  {c |}{col 15}{res}{space 2}-.0849589{col 27}{space 2} .0494877{col 38}{space 1}   -1.72{col 47}{space 3}0.103{col 55}{space 4}-.1889288{col 68}{space 3} .0190109
{txt}{space 9}681  {c |}{col 15}{res}{space 2}-.0124641{col 27}{space 2} .0686834{col 38}{space 1}   -0.18{col 47}{space 3}0.858{col 55}{space 4}-.1567627{col 68}{space 3} .1318344
{txt}{space 9}682  {c |}{col 15}{res}{space 2}-.0253532{col 27}{space 2} .0319363{col 38}{space 1}   -0.79{col 47}{space 3}0.438{col 55}{space 4}-.0924489{col 68}{space 3} .0417425
{txt}{space 9}683  {c |}{col 15}{res}{space 2}-.0392706{col 27}{space 2} .0459569{col 38}{space 1}   -0.85{col 47}{space 3}0.404{col 55}{space 4}-.1358226{col 68}{space 3} .0572813
{txt}{space 9}684  {c |}{col 15}{res}{space 2} .0129785{col 27}{space 2} .0302475{col 38}{space 1}    0.43{col 47}{space 3}0.673{col 55}{space 4}-.0505691{col 68}{space 3} .0765262
{txt}{space 9}685  {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 9}686  {c |}{col 15}{res}{space 2}-.0094633{col 27}{space 2}  .031627{col 38}{space 1}   -0.30{col 47}{space 3}0.768{col 55}{space 4}-.0759091{col 68}{space 3} .0569825
{txt}{space 9}687  {c |}{col 15}{res}{space 2}   .03273{col 27}{space 2} .0202495{col 38}{space 1}    1.62{col 47}{space 3}0.123{col 55}{space 4}-.0098126{col 68}{space 3} .0752726
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} 9.238913{col 27}{space 2} .4770807{col 38}{space 1}   19.37{col 47}{space 3}0.000{col 55}{space 4} 8.236604{col 68}{space 3} 10.24122
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |} {res} .23862352
      {txt}sigma_e {c |} {res} .19892612
          {txt}rho {c |} {res} .58998591{txt}   (fraction of variance due to u_i)
{hline 14}{c BT}{hline 64}

{com}. 
. * Add fixed effects labels to the table
. estadd local Time_FE "yes"  

{txt}added macro:
            e(Time_FE) : "{res:yes}"

{com}. estadd local Household_FE "yes"  

{txt}added macro:
       e(Household_FE) : "{res:yes}"

{com}. 
. * Export regression results to LaTeX for small farmers
. esttab est2 using didreg2.tex, ///
>    cells(b(fmt(3) star) se(fmt(3) par)) ///
>    label nodepvars nomtitle nonumber ///
>    noobs collabels("Dependent Variable: Log total expenditure" "") ///
>    varlabels(NK "New Kingdom" KG "King's Gift"  NK_KG "New Kingdom*King's Gift" inflation_r "Rural Inflation" ln_resid_income "Residual Income") ///
>    stats(r2 N) ///
>    starlevels(* 0.10 * 0.05 ** 0.01) ///
>    addnote("***p$<$0.01, ** p$<$0.05, * p$<$0.1") ///
>    title("Regression Results showing effect of cash transfer policy to small farmers of Vastrapur") ///
>    replace  
{res}{txt}(output written to {browse  `"didreg2.tex"'})

{com}. 
. * Store and label the third regression results (large farmers) for LaTeX output
. eststo est3: xtreg ln_total_expenditure NK KG NK_KG ln_resid_income inflation_r i.time if is_large_farmer == 1, fe vce(cluster province)  
{txt}note: NK omitted because of collinearity
note: 684.time omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}     4061
{txt}Group variable: {res}hh_id                           {txt}Number of groups   = {res}      629

{txt}R-sq:  Within  = {res}0.0889                         {txt}Obs per group: min = {res}        1
{txt}       Between = {res}0.1137                                        {txt}avg = {res}      6.5
{txt}       Overall = {res}0.0825                                        {txt}max = {res}       18

{col 49}{help j_robustsingular##|_new:F(17,17)}{col 68}{txt}={col 70}{res}        .
{txt}corr(u_i, Xb)  = {res}0.0290                         {txt}Prob > F           =    {res}     .

{txt}{ralign 79:(Std. err. adjusted for {res:18} clusters in {res:province})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}ln_total_ex~e{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}NK {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 11}KG {c |}{col 15}{res}{space 2} .1046444{col 27}{space 2} .0686764{col 38}{space 1}    1.52{col 47}{space 3}0.146{col 55}{space 4}  -.04025{col 68}{space 3} .2495389
{txt}{space 8}NK_KG {c |}{col 15}{res}{space 2} .0764371{col 27}{space 2} .0724559{col 38}{space 1}    1.05{col 47}{space 3}0.306{col 55}{space 4}-.0764316{col 68}{space 3} .2293058
{txt}ln_resid_in~e {c |}{col 15}{res}{space 2}-.0018448{col 27}{space 2} .0040503{col 38}{space 1}   -0.46{col 47}{space 3}0.655{col 55}{space 4}-.0103902{col 68}{space 3} .0067007
{txt}{space 2}inflation_r {c |}{col 15}{res}{space 2}-.0062591{col 27}{space 2} .0060213{col 38}{space 1}   -1.04{col 47}{space 3}0.313{col 55}{space 4}-.0189631{col 68}{space 3} .0064448
{txt}{space 13} {c |}
{space 9}time {c |}
{space 9}671  {c |}{col 15}{res}{space 2} .0016659{col 27}{space 2} .0240298{col 38}{space 1}    0.07{col 47}{space 3}0.946{col 55}{space 4}-.0490326{col 68}{space 3} .0523644
{txt}{space 9}672  {c |}{col 15}{res}{space 2} .1606194{col 27}{space 2} .0482067{col 38}{space 1}    3.33{col 47}{space 3}0.004{col 55}{space 4} .0589122{col 68}{space 3} .2623266
{txt}{space 9}673  {c |}{col 15}{res}{space 2} .0127495{col 27}{space 2} .0609814{col 38}{space 1}    0.21{col 47}{space 3}0.837{col 55}{space 4}  -.11591{col 68}{space 3}  .141409
{txt}{space 9}674  {c |}{col 15}{res}{space 2} .0395434{col 27}{space 2}  .064423{col 38}{space 1}    0.61{col 47}{space 3}0.547{col 55}{space 4}-.0963771{col 68}{space 3}  .175464
{txt}{space 9}675  {c |}{col 15}{res}{space 2} .0273758{col 27}{space 2} .0603066{col 38}{space 1}    0.45{col 47}{space 3}0.656{col 55}{space 4}-.0998601{col 68}{space 3} .1546117
{txt}{space 9}676  {c |}{col 15}{res}{space 2}-.0760795{col 27}{space 2} .0528925{col 38}{space 1}   -1.44{col 47}{space 3}0.168{col 55}{space 4}-.1876729{col 68}{space 3}  .035514
{txt}{space 9}677  {c |}{col 15}{res}{space 2} .0290436{col 27}{space 2} .0587401{col 38}{space 1}    0.49{col 47}{space 3}0.627{col 55}{space 4}-.0948873{col 68}{space 3} .1529744
{txt}{space 9}678  {c |}{col 15}{res}{space 2} .0208036{col 27}{space 2} .0541842{col 38}{space 1}    0.38{col 47}{space 3}0.706{col 55}{space 4} -.093515{col 68}{space 3} .1351222
{txt}{space 9}679  {c |}{col 15}{res}{space 2} .0360107{col 27}{space 2}  .044096{col 38}{space 1}    0.82{col 47}{space 3}0.425{col 55}{space 4}-.0570238{col 68}{space 3} .1290451
{txt}{space 9}680  {c |}{col 15}{res}{space 2} .0239178{col 27}{space 2} .0412674{col 38}{space 1}    0.58{col 47}{space 3}0.570{col 55}{space 4}-.0631487{col 68}{space 3} .1109843
{txt}{space 9}681  {c |}{col 15}{res}{space 2} .0829374{col 27}{space 2} .0365663{col 38}{space 1}    2.27{col 47}{space 3}0.037{col 55}{space 4} .0057894{col 68}{space 3} .1600855
{txt}{space 9}682  {c |}{col 15}{res}{space 2} .0435947{col 27}{space 2} .0279445{col 38}{space 1}    1.56{col 47}{space 3}0.137{col 55}{space 4}-.0153629{col 68}{space 3} .1025524
{txt}{space 9}683  {c |}{col 15}{res}{space 2}-.0096229{col 27}{space 2} .0263691{col 38}{space 1}   -0.36{col 47}{space 3}0.720{col 55}{space 4}-.0652568{col 68}{space 3}  .046011
{txt}{space 9}684  {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 9}685  {c |}{col 15}{res}{space 2}-.0056101{col 27}{space 2} .0335558{col 38}{space 1}   -0.17{col 47}{space 3}0.869{col 55}{space 4}-.0764067{col 68}{space 3} .0651864
{txt}{space 9}686  {c |}{col 15}{res}{space 2} .0043656{col 27}{space 2} .0434317{col 38}{space 1}    0.10{col 47}{space 3}0.921{col 55}{space 4}-.0872674{col 68}{space 3} .0959986
{txt}{space 9}687  {c |}{col 15}{res}{space 2} .0270572{col 27}{space 2} .0504696{col 38}{space 1}    0.54{col 47}{space 3}0.599{col 55}{space 4}-.0794244{col 68}{space 3} .1335388
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} 10.18695{col 27}{space 2} .8832242{col 38}{space 1}   11.53{col 47}{space 3}0.000{col 55}{space 4} 8.323513{col 68}{space 3} 12.05039
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |} {res} .25104059
      {txt}sigma_e {c |} {res} .20527971
          {txt}rho {c |} {res}  .5992839{txt}   (fraction of variance due to u_i)
{hline 14}{c BT}{hline 64}

{com}. 
. * Add fixed effects labels to the table
. estadd local Time_FE "yes"  

{txt}added macro:
            e(Time_FE) : "{res:yes}"

{com}. estadd local Household_FE "yes"  

{txt}added macro:
       e(Household_FE) : "{res:yes}"

{com}. 
. * Export regression results to LaTeX for large farmers
. esttab est3 using didreg3.tex, ///
>    cells(b(fmt(3) star) se(fmt(3) par)) ///
>    label nodepvars nomtitle nonumber ///
>    noobs collabels("Dependent Variable: Log total expenditure" "") ///
>    varlabels(NK "New Kingdom" KG "King's Gift"  NK_KG "New Kingdom*King's Gift" inflation_r "Rural Inflation" ln_resid_income "Residual Income") ///
>    stats(r2 N) ///
>    starlevels(* 0.10 * 0.05 ** 0.01) ///
>    addnote("***p$<$0.01, ** p$<$0.05, * p$<$0.1") ///
>    title("Regression Results showing effect of cash transfer policy to large farmers of Vastrapur") ///
>    replace  
{res}{txt}(output written to {browse  `"didreg3.tex"'})

{com}. 
. * Store and label the fourth regression results (agricultural laborers) for LaTeX output
. eststo est4: xtreg ln_total_expenditure NK KG NK_KG ln_resid_income inflation_r i.time if is_agri_labourer == 1, fe vce(cluster province)  
{txt}note: NK omitted because of collinearity
note: 679.time omitted because of collinearity

Fixed-effects (within) regression               Number of obs      = {res}    11200
{txt}Group variable: {res}hh_id                           {txt}Number of groups   = {res}     1520

{txt}R-sq:  Within  = {res}0.1456                         {txt}Obs per group: min = {res}        1
{txt}       Between = {res}0.2454                                        {txt}avg = {res}      7.4
{txt}       Overall = {res}0.2373                                        {txt}max = {res}       18

{col 49}{help j_robustsingular##|_new:F(18,18)}{col 68}{txt}={col 70}{res}        .
{txt}corr(u_i, Xb)  = {res}0.2660                         {txt}Prob > F           =    {res}     .

{txt}{ralign 79:(Std. err. adjusted for {res:19} clusters in {res:province})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}ln_total_ex~e{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 11}NK {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 11}KG {c |}{col 15}{res}{space 2} .2354737{col 27}{space 2} .0474796{col 38}{space 1}    4.96{col 47}{space 3}0.000{col 55}{space 4} .1357229{col 68}{space 3} .3352246
{txt}{space 8}NK_KG {c |}{col 15}{res}{space 2}-.0037035{col 27}{space 2} .0512559{col 38}{space 1}   -0.07{col 47}{space 3}0.943{col 55}{space 4}-.1113881{col 68}{space 3} .1039811
{txt}ln_resid_in~e {c |}{col 15}{res}{space 2} .1260045{col 27}{space 2} .0219198{col 38}{space 1}    5.75{col 47}{space 3}0.000{col 55}{space 4} .0799527{col 68}{space 3} .1720562
{txt}{space 2}inflation_r {c |}{col 15}{res}{space 2} .0144777{col 27}{space 2} .0065354{col 38}{space 1}    2.22{col 47}{space 3}0.040{col 55}{space 4} .0007473{col 68}{space 3}  .028208
{txt}{space 13} {c |}
{space 9}time {c |}
{space 9}671  {c |}{col 15}{res}{space 2} .0713482{col 27}{space 2} .0193469{col 38}{space 1}    3.69{col 47}{space 3}0.002{col 55}{space 4} .0307018{col 68}{space 3} .1119946
{txt}{space 9}672  {c |}{col 15}{res}{space 2} .1843591{col 27}{space 2} .0266362{col 38}{space 1}    6.92{col 47}{space 3}0.000{col 55}{space 4} .1283985{col 68}{space 3} .2403197
{txt}{space 9}673  {c |}{col 15}{res}{space 2} .0832402{col 27}{space 2}  .057775{col 38}{space 1}    1.44{col 47}{space 3}0.167{col 55}{space 4}-.0381406{col 68}{space 3} .2046211
{txt}{space 9}674  {c |}{col 15}{res}{space 2} .1565513{col 27}{space 2} .0555269{col 38}{space 1}    2.82{col 47}{space 3}0.011{col 55}{space 4} .0398937{col 68}{space 3} .2732089
{txt}{space 9}675  {c |}{col 15}{res}{space 2} .1807318{col 27}{space 2} .0657353{col 38}{space 1}    2.75{col 47}{space 3}0.013{col 55}{space 4} .0426272{col 68}{space 3} .3188365
{txt}{space 9}676  {c |}{col 15}{res}{space 2}-.0540779{col 27}{space 2}  .062409{col 38}{space 1}   -0.87{col 47}{space 3}0.398{col 55}{space 4}-.1851945{col 68}{space 3} .0770386
{txt}{space 9}677  {c |}{col 15}{res}{space 2} .0335213{col 27}{space 2} .0328233{col 38}{space 1}    1.02{col 47}{space 3}0.321{col 55}{space 4}-.0354379{col 68}{space 3} .1024806
{txt}{space 9}678  {c |}{col 15}{res}{space 2} .0064513{col 27}{space 2} .0264114{col 38}{space 1}    0.24{col 47}{space 3}0.810{col 55}{space 4}-.0490369{col 68}{space 3} .0619395
{txt}{space 9}679  {c |}{col 15}{res}{space 2}        0{col 27}{txt}  (omitted)
{space 9}680  {c |}{col 15}{res}{space 2}-.0490551{col 27}{space 2}  .033049{col 38}{space 1}   -1.48{col 47}{space 3}0.155{col 55}{space 4}-.1184885{col 68}{space 3} .0203783
{txt}{space 9}681  {c |}{col 15}{res}{space 2} .0501476{col 27}{space 2} .0464269{col 38}{space 1}    1.08{col 47}{space 3}0.294{col 55}{space 4}-.0473918{col 68}{space 3} .1476869
{txt}{space 9}682  {c |}{col 15}{res}{space 2} .0459155{col 27}{space 2} .0726798{col 38}{space 1}    0.63{col 47}{space 3}0.535{col 55}{space 4}-.1067791{col 68}{space 3} .1986101
{txt}{space 9}683  {c |}{col 15}{res}{space 2} .0608081{col 27}{space 2}  .064534{col 38}{space 1}    0.94{col 47}{space 3}0.359{col 55}{space 4}-.0747728{col 68}{space 3}  .196389
{txt}{space 9}684  {c |}{col 15}{res}{space 2} .0646876{col 27}{space 2} .0528521{col 38}{space 1}    1.22{col 47}{space 3}0.237{col 55}{space 4}-.0463505{col 68}{space 3} .1757256
{txt}{space 9}685  {c |}{col 15}{res}{space 2} .0822938{col 27}{space 2} .0574844{col 38}{space 1}    1.43{col 47}{space 3}0.169{col 55}{space 4}-.0384766{col 68}{space 3} .2030641
{txt}{space 9}686  {c |}{col 15}{res}{space 2} .0957572{col 27}{space 2}  .062744{col 38}{space 1}    1.53{col 47}{space 3}0.144{col 55}{space 4}-.0360632{col 68}{space 3} .2275775
{txt}{space 9}687  {c |}{col 15}{res}{space 2} .1128204{col 27}{space 2} .0526157{col 38}{space 1}    2.14{col 47}{space 3}0.046{col 55}{space 4} .0022789{col 68}{space 3}  .223362
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} 5.614702{col 27}{space 2} .9354033{col 38}{space 1}    6.00{col 47}{space 3}0.000{col 55}{space 4} 3.649493{col 68}{space 3} 7.579912
{txt}{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
      sigma_u {c |} {res} .27389689
      {txt}sigma_e {c |} {res} .21532849
          {txt}rho {c |} {res} .61802507{txt}   (fraction of variance due to u_i)
{hline 14}{c BT}{hline 64}

{com}. 
. * Add fixed effects labels to the table
. estadd local Time_FE "yes"  

{txt}added macro:
            e(Time_FE) : "{res:yes}"

{com}. estadd local Household_FE "yes"  

{txt}added macro:
       e(Household_FE) : "{res:yes}"

{com}. 
. * Export regression results to LaTeX for agricultural laborers
. esttab est4 using didreg4.tex, ///
>    cells(b(fmt(3) star) se(fmt(3) par)) ///
>    label nodepvars nomtitle nonumber ///
>    noobs collabels("Dependent Variable: Log total expenditure" "") ///
>    varlabels(NK "New Kingdom" KG "King's Gift"  NK_KG "New Kingdom*King's Gift" inflation_r "Rural Inflation" ln_resid_income "Residual Income") ///
>    stats(r2 N) ///
>    starlevels(* 0.10 * 0.05 ** 0.01) ///
>    addnote("***p$<$0.01, ** p$<$0.05, * p$<$0.1") ///
>    title("Regression Results showing effect of cash transfer policy to agricultural labourers of Vastrapur") ///
>    replace  
{res}{txt}(output written to {browse  `"didreg4.tex"'})

{com}. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Administrator\Downloads\King Stata final test.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}23 Jan 2025, 01:16:04
{txt}{.-}
{smcl}
{txt}{sf}{ul off}